##### Cours : Apply Functions to Multiple Columns - Pandas For Machine Learning 16
##### Lien : https://www.youtube.com/watch?v=wW-GuY2cUXI


##### Date : 19-12-22
***

In [1]:
import pandas as pd
import numpy as np

In [2]:
# Create data
stuff = {
    "Corporation":['Apple', 'Google', 'Meta', 'Apple', 'Google', 'Meta'],
    "Employees":['John', 'April', 'Wes', 'Beth', 'Justin', 'Steph'],
    "Salary":[200, 220, 190, 130, 120, 150]}

In [3]:
# Create DF
my_df = pd.DataFrame(stuff)
my_df

  Corporation Employees  Salary
0       Apple      John     200
1      Google     April     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

In [4]:
# Create function
def times1000(x):
    return format(x * 1_000, ",d")

In [5]:
# Use Apply function
my_df["Salary"].apply(times1000)

0    200,000
1    220,000
2    190,000
3    130,000
4    120,000
5    150,000
Name: Salary, dtype: object

In [11]:
# Append to current DF
my_df['Salary'] = my_df["Salary"].apply(times1000)
my_df

  Corporation Employees   Salary
0       Apple      John  200,000
1      Google     April  220,000
2        Meta       Wes  190,000
3       Apple      Beth  130,000
4      Google    Justin  120,000
5        Meta     Steph  150,000

In [12]:
# Function on multiple columns
def namer(x):
    return 'Codemy: ' + x

In [13]:
# Apply to two columns
my_df[['Corporation', 'Employees']].apply(namer)

      Corporation       Employees
0   Codemy: Apple    Codemy: John
1  Codemy: Google   Codemy: April
2    Codemy: Meta     Codemy: Wes
3   Codemy: Apple    Codemy: Beth
4  Codemy: Google  Codemy: Justin
5    Codemy: Meta   Codemy: Steph

In [14]:
# Append to current DF
my_df[['Corporation', 'Employees']] = my_df[['Corporation', 'Employees']].apply(namer)
my_df

      Corporation       Employees   Salary
0   Codemy: Apple    Codemy: John  200,000
1  Codemy: Google   Codemy: April  220,000
2    Codemy: Meta     Codemy: Wes  190,000
3   Codemy: Apple    Codemy: Beth  130,000
4  Codemy: Google  Codemy: Justin  120,000
5    Codemy: Meta   Codemy: Steph  150,000